app/controllers/playlist_controller.rb

INSERT INTO "playlists" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-08-28 00:23:22.539733"], ["updated_at", "2015-08-28 00:23:22.539733"]]
---
        def new
		# create a new blank playlist
                playlist = Playlist.create

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", 55]]
SELECT COUNT(*) FROM "playlist_styles" WHERE "playlist_styles"."playlist_id" = $1  [["playlist_id", 76]]
INSERT INTO "playlist_styles" ("playlist_id", "background_color", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["playlist_id", 76], ["background_color", "#ff9300"], ["color", "#00f900"], ["created_at", "2015-08-28 05:39:07.282914"], ["updated_at", "2015-08-28 05:39:07.282914"]]
UPDATE "playlists" SET "title" = $1, "updated_at" = $2 WHERE "playlists"."id" = $3  [["title", "Title"], ["updated_at", "2015-08-28 01:37:13.756966"], ["id", 56]]
---
        def edit
		# get relevant playlist
                @playlist = Playlist.find params[:id]

		# update style record if such paramaters exist
                if params[:style]
			# create a new playlist_style record where none exists
                        if PlaylistStyle.where(playlist_id:@playlist.id).count == 0
                                playlist_style = PlaylistStyle.new
                                playlist_style.playlist_id = @playlist.id
			# otherwise get existing record
			else
				playlist_style = PlaylistStyle.where(playlist_id:@playlist.id)
			end

			# set playlist_style properties and save
			playlist_style.background_color = params[:style][:bgcolor]
			playlist_style.color = params[:style][:color]
			playlist_style.save

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", 56]]
SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."playlist_id" = $1  ORDER BY created_at DESC  [["playlist_id", 56]]
---
        def show
		# get relevant playlist
                @playlist = Playlist.find params[:id]

		# gather songs for playlist
                @songs = PlaylistSong.where(playlist_id: @playlist.id).order('created_at DESC')

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", 64]]
SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."playlist_id" = 64
DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 64]]
---
        def destroy
		# get relevant playlist and destroy
                @playlist = Playlist.find params[:id]
                @songs = PlaylistSong.where(playlist_id: @playlist)

                for song in @songs
                        song.destroy
                end

                @playlist.destroy